_libs_/cubeia-cubeia-network/accounting-service/service-web/src/test/resources/jmeter/load-accounts.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="2.1">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Main Users" enabled="true">
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">500</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <longProp name="ThreadGroup.start_time">1243255909000</longProp>
        <longProp name="ThreadGroup.end_time">1243255909000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
      </ThreadGroup>
      <hashTree>
        <LoopController guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">true</boolProp>
          <stringProp name="LoopController.loops">100</stringProp>
        </LoopController>
        <hashTree>
          <ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="Deposit / Withdraw" enabled="true">
            <intProp name="ThroughputController.style">1</intProp>
            <boolProp name="ThroughputController.perThread">true</boolProp>
            <intProp name="ThroughputController.maxThroughput">1</intProp>
            <FloatProperty>
              <name>ThroughputController.percentThroughput</name>
              <value>5.0</value>
              <savedValue>0.0</savedValue>
            </FloatProperty>
          </ThroughputController>
          <hashTree>
            <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="1 -5" enabled="true">
              <stringProp name="ConstantTimer.delay">1000</stringProp>
              <stringProp name="RandomTimer.range">5000.0</stringProp>
            </UniformRandomTimer>
            <hashTree/>
            <InterleaveControl guiclass="InterleaveControlGui" testclass="InterleaveControl" testname="Interleave Controller" enabled="true">
              <intProp name="InterleaveControl.style">1</intProp>
            </InterleaveControl>
            <hashTree>
              <WebServiceSampler guiclass="WebServiceSamplerGui" testclass="WebServiceSampler" testname="from External" enabled="true">
                <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
                  <collectionProp name="Arguments.arguments"/>
                </elementProp>
                <stringProp name="HTTPSampler.domain">localhost</stringProp>
                <stringProp name="HTTPSampler.port">5080</stringProp>
                <stringProp name="HTTPSampler.protocol">http</stringProp>
                <stringProp name="HTTPSampler.path">/accounting-service/soap</stringProp>
                <stringProp name="WebserviceSampler.wsdl_url">http://localhost:5080/accounting-service/soap?wsdl</stringProp>
                <stringProp name="HTTPSampler.method">POST</stringProp>
                <stringProp name="HTTPSamper.xml_data">&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:api=&quot;http://api.accounting.backoffice.cubeia.com/&quot;&gt;
   &lt;soapenv:Header/&gt;
   &lt;soapenv:Body&gt;
      &lt;api:createTransactionOne&gt;
         &lt;comment&gt;Deposit from External&lt;/comment&gt;
         &lt;amount&gt;${__Random(10,70)}&lt;/amount&gt;
         &lt;fromAccountId&gt;1002&lt;/fromAccountId&gt;
         &lt;toAccountId&gt;${__threadNum}&lt;/toAccountId&gt;
      &lt;/api:createTransactionOne&gt;
   &lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;</stringProp>
                <stringProp name="WebServiceSampler.memory_cache">true</stringProp>
                <stringProp name="WebServiceSampler.read_response">false</stringProp>
                <stringProp name="WebServiceSampler.use_proxy">false</stringProp>
              </WebServiceSampler>
              <hashTree/>
              <WebServiceSampler guiclass="WebServiceSamplerGui" testclass="WebServiceSampler" testname="to External" enabled="true">
                <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
                  <collectionProp name="Arguments.arguments"/>
                </elementProp>
                <stringProp name="HTTPSampler.domain">localhost</stringProp>
                <stringProp name="HTTPSampler.port">5080</stringProp>
                <stringProp name="HTTPSampler.protocol">http</stringProp>
                <stringProp name="HTTPSampler.path">/accounting-service/soap</stringProp>
                <stringProp name="HTTPSampler.method">POST</stringProp>
                <stringProp name="HTTPSamper.xml_data">&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:api=&quot;http://api.accounting.backoffice.cubeia.com/&quot;&gt;
   &lt;soapenv:Header/&gt;
   &lt;soapenv:Body&gt;
      &lt;api:createTransactionOne&gt;
         &lt;comment&gt;Withdraw to External&lt;/comment&gt;
         &lt;amount&gt;${__Random(10,70)}&lt;/amount&gt;
         &lt;fromAccountId&gt;${__threadNum}&lt;/fromAccountId&gt;
         &lt;toAccountId&gt;1002&lt;/toAccountId&gt;
      &lt;/api:createTransactionOne&gt;
   &lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;</stringProp>
                <stringProp name="WebServiceSampler.memory_cache">true</stringProp>
                <stringProp name="WebServiceSampler.read_response">false</stringProp>
                <stringProp name="WebServiceSampler.use_proxy">false</stringProp>
              </WebServiceSampler>
              <hashTree/>
            </hashTree>
            <WebServiceSampler guiclass="WebServiceSamplerGui" testclass="WebServiceSampler" testname="List External" enabled="true">
              <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
                <collectionProp name="Arguments.arguments"/>
              </elementProp>
              <stringProp name="HTTPSampler.domain">localhost</stringProp>
              <stringProp name="HTTPSampler.port">5080</stringProp>
              <stringProp name="HTTPSampler.protocol">http</stringProp>
              <stringProp name="HTTPSampler.path">/accounting-service/soap</stringProp>
              <stringProp name="HTTPSampler.method">POST</stringProp>
              <stringProp name="HTTPSamper.xml_data">&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:api=&quot;http://api.accounting.backoffice.cubeia.com/&quot;&gt;
   &lt;soapenv:Header/&gt;
   &lt;soapenv:Body&gt;
      &lt;api:listTransactions&gt;
         &lt;idOne&gt;${__threadNum}&lt;/idOne&gt;
         &lt;isIdOneExternalId&gt;false&lt;/isIdOneExternalId&gt;
         &lt;idTwo&gt;1002&lt;/idTwo&gt;
         &lt;isIdTwoExternalId&gt;false&lt;/isIdTwoExternalId&gt;
         &lt;offset&gt;1&lt;/offset&gt;
         &lt;limit&gt;11&lt;/limit&gt;
         &lt;isAscending&gt;true&lt;/isAscending&gt;
      &lt;/api:listTransactions&gt;
   &lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;</stringProp>
              <stringProp name="WebServiceSampler.memory_cache">true</stringProp>
              <stringProp name="WebServiceSampler.read_response">false</stringProp>
              <stringProp name="WebServiceSampler.use_proxy">false</stringProp>
            </WebServiceSampler>
            <hashTree/>
          </hashTree>
          <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="0.2 - 1" enabled="true">
            <stringProp name="ConstantTimer.delay">200</stringProp>
            <stringProp name="RandomTimer.range">1000.0</stringProp>
          </UniformRandomTimer>
          <hashTree/>
          <WebServiceSampler guiclass="WebServiceSamplerGui" testclass="WebServiceSampler" testname="to System" enabled="true">
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments"/>
            </elementProp>
            <stringProp name="HTTPSampler.domain">localhost</stringProp>
            <stringProp name="HTTPSampler.port">5080</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/accounting-service/soap</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <stringProp name="HTTPSamper.xml_data">&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:api=&quot;http://api.accounting.backoffice.cubeia.com/&quot;&gt;
   &lt;soapenv:Header/&gt;
   &lt;soapenv:Body&gt;
      &lt;api:createTransactionOne&gt;
         &lt;comment&gt;Withdraw to External&lt;/comment&gt;
         &lt;amount&gt;${__Random(1,10)}&lt;/amount&gt;
         &lt;fromAccountId&gt;${__threadNum}&lt;/fromAccountId&gt;
         &lt;toAccountId&gt;1001&lt;/toAccountId&gt;
      &lt;/api:createTransactionOne&gt;
   &lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;</stringProp>
            <stringProp name="WebServiceSampler.memory_cache">true</stringProp>
            <stringProp name="WebServiceSampler.read_response">false</stringProp>
            <stringProp name="WebServiceSampler.use_proxy">false</stringProp>
          </WebServiceSampler>
          <hashTree/>
          <ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="Win" enabled="true">
            <intProp name="ThroughputController.style">1</intProp>
            <boolProp name="ThroughputController.perThread">true</boolProp>
            <intProp name="ThroughputController.maxThroughput">1</intProp>
            <FloatProperty>
              <name>ThroughputController.percentThroughput</name>
              <value>10.0</value>
              <savedValue>0.0</savedValue>
            </FloatProperty>
          </ThroughputController>
          <hashTree>
            <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="1 - 5" enabled="true">
              <stringProp name="ConstantTimer.delay">1000</stringProp>
              <stringProp name="RandomTimer.range">5000.0</stringProp>
            </UniformRandomTimer>
            <hashTree/>
            <WebServiceSampler guiclass="WebServiceSamplerGui" testclass="WebServiceSampler" testname="from system" enabled="true">
              <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
                <collectionProp name="Arguments.arguments"/>
              </elementProp>
              <stringProp name="HTTPSampler.domain">localhost</stringProp>
              <stringProp name="HTTPSampler.port">5080</stringProp>
              <stringProp name="HTTPSampler.protocol">http</stringProp>
              <stringProp name="HTTPSampler.path">/accounting-service/soap</stringProp>
              <stringProp name="HTTPSampler.method">POST</stringProp>
              <stringProp name="HTTPSamper.xml_data">&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:api=&quot;http://api.accounting.backoffice.cubeia.com/&quot;&gt;
   &lt;soapenv:Header/&gt;
   &lt;soapenv:Body&gt;
      &lt;api:createTransactionOne&gt;
         &lt;comment&gt;Withdraw to External&lt;/comment&gt;
         &lt;amount&gt;${__Random(5,50)}&lt;/amount&gt;
         &lt;fromAccountId&gt;1001&lt;/fromAccountId&gt;
         &lt;toAccountId&gt;${__threadNum}&lt;/toAccountId&gt;
      &lt;/api:createTransactionOne&gt;
   &lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;</stringProp>
              <stringProp name="WebServiceSampler.memory_cache">true</stringProp>
              <stringProp name="WebServiceSampler.read_response">false</stringProp>
              <stringProp name="WebServiceSampler.use_proxy">false</stringProp>
            </WebServiceSampler>
            <hashTree/>
            <WebServiceSampler guiclass="WebServiceSamplerGui" testclass="WebServiceSampler" testname="List System" enabled="true">
              <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
                <collectionProp name="Arguments.arguments"/>
              </elementProp>
              <stringProp name="HTTPSampler.domain">localhost</stringProp>
              <stringProp name="HTTPSampler.port">5080</stringProp>
              <stringProp name="HTTPSampler.protocol">http</stringProp>
              <stringProp name="HTTPSampler.path">/accounting-service/soap</stringProp>
              <stringProp name="HTTPSampler.method">POST</stringProp>
              <stringProp name="HTTPSamper.xml_data">&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:api=&quot;http://api.accounting.backoffice.cubeia.com/&quot;&gt;
   &lt;soapenv:Header/&gt;
   &lt;soapenv:Body&gt;
      &lt;api:listTransactions&gt;
         &lt;idOne&gt;${__threadNum}&lt;/idOne&gt;
         &lt;isIdOneExternalId&gt;false&lt;/isIdOneExternalId&gt;
         &lt;idTwo&gt;1001&lt;/idTwo&gt;
         &lt;isIdTwoExternalId&gt;false&lt;/isIdTwoExternalId&gt;
         &lt;offset&gt;1&lt;/offset&gt;
         &lt;limit&gt;11&lt;/limit&gt;
         &lt;isAscending&gt;true&lt;/isAscending&gt;
      &lt;/api:listTransactions&gt;
   &lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;</stringProp>
              <stringProp name="WebServiceSampler.memory_cache">true</stringProp>
              <stringProp name="WebServiceSampler.read_response">false</stringProp>
              <stringProp name="WebServiceSampler.use_proxy">false</stringProp>
            </WebServiceSampler>
            <hashTree/>
          </hashTree>
          <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="0.1 - 0.5" enabled="true">
            <stringProp name="ConstantTimer.delay">100</stringProp>
            <stringProp name="RandomTimer.range">500.0</stringProp>
          </UniformRandomTimer>
          <hashTree/>
          <WebServiceSampler guiclass="WebServiceSamplerGui" testclass="WebServiceSampler" testname="Balance" enabled="true">
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments"/>
            </elementProp>
            <stringProp name="HTTPSampler.domain">localhost</stringProp>
            <stringProp name="HTTPSampler.port">5080</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/accounting-service/soap</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <stringProp name="HTTPSamper.xml_data">&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:api=&quot;http://api.accounting.backoffice.cubeia.com/&quot;&gt;
   &lt;soapenv:Header/&gt;
   &lt;soapenv:Body&gt;
      &lt;api:getBalance&gt;
         &lt;accountId&gt;${__threadNum}&lt;/accountId&gt;
      &lt;/api:getBalance&gt;
   &lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;</stringProp>
            <stringProp name="WebServiceSampler.memory_cache">true</stringProp>
            <stringProp name="WebServiceSampler.read_response">false</stringProp>
            <stringProp name="WebServiceSampler.use_proxy">false</stringProp>
          </WebServiceSampler>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>